Resources/canonical_library/wsdl/RFC_READ_TABLEPortType.wsdl

<?xml version="1.0" encoding="UTF-8"?><definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:s0="urn:sap-com:document:sap:rfc:functions" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" targetNamespace="urn:sap-com:document:sap:rfc:functions"><types><xsd:schema targetNamespace="urn:sap-com:document:sap:rfc:functions"><xsd:element name="RFC_READ_TABLE"><xsd:complexType><xsd:all><xsd:element name="DATA"><xsd:complexType><xsd:sequence><xsd:element name="item" minOccurs="0" maxOccurs="unbounded" type="s0:TAB512"></xsd:element></xsd:sequence></xsd:complexType></xsd:element><xsd:element name="DELIMITER" minOccurs="0"><xsd:simpleType><xsd:restriction base="xsd:string"><xsd:maxLength value="1"></xsd:maxLength></xsd:restriction></xsd:simpleType></xsd:element><xsd:element name="FIELDS"><xsd:complexType><xsd:sequence><xsd:element name="item" minOccurs="0" maxOccurs="unbounded" type="s0:RFC_DB_FLD"></xsd:element></xsd:sequence></xsd:complexType></xsd:element><xsd:element name="GET_SORTED" minOccurs="0"><xsd:simpleType><xsd:restriction base="xsd:string"><xsd:maxLength value="1"></xsd:maxLength></xsd:restriction></xsd:simpleType></xsd:element><xsd:element name="NO_DATA" minOccurs="0"><xsd:simpleType><xsd:restriction base="xsd:string"><xsd:maxLength value="1"></xsd:maxLength></xsd:restriction></xsd:simpleType></xsd:element><xsd:element name="OPTIONS"><xsd:complexType><xsd:sequence><xsd:element name="item" minOccurs="0" maxOccurs="unbounded" type="s0:RFC_DB_OPT"></xsd:element></xsd:sequence></xsd:complexType></xsd:element><xsd:element name="QUERY_TABLE"><xsd:simpleType><xsd:restriction base="xsd:string"><xsd:maxLength value="30"></xsd:maxLength></xsd:restriction></xsd:simpleType></xsd:element><xsd:element name="ROWCOUNT" minOccurs="0" type="xsd:int"></xsd:element><xsd:element name="ROWSKIPS" minOccurs="0" type="xsd:int"></xsd:element><xsd:element name="USE_ET_DATA_4_RETURN" minOccurs="0"><xsd:simpleType><xsd:restriction base="xsd:string"><xsd:maxLength value="1"></xsd:maxLength></xsd:restriction></xsd:simpleType></xsd:element></xsd:all></xsd:complexType></xsd:element><xsd:element name="RFC_READ_TABLE.Response"><xsd:complexType><xsd:all><xsd:element name="DATA"><xsd:complexType><xsd:sequence><xsd:element name="item" minOccurs="0" maxOccurs="unbounded" type="s0:TAB512"></xsd:element></xsd:sequence></xsd:complexType></xsd:element><xsd:element name="ET_DATA"><xsd:complexType><xsd:sequence><xsd:element name="item" minOccurs="0" maxOccurs="unbounded" type="s0:SDTI_RESULT"></xsd:element></xsd:sequence></xsd:complexType></xsd:element><xsd:element name="FIELDS"><xsd:complexType><xsd:sequence><xsd:element name="item" minOccurs="0" maxOccurs="unbounded" type="s0:RFC_DB_FLD"></xsd:element></xsd:sequence></xsd:complexType></xsd:element><xsd:element name="OPTIONS"><xsd:complexType><xsd:sequence><xsd:element name="item" minOccurs="0" maxOccurs="unbounded" type="s0:RFC_DB_OPT"></xsd:element></xsd:sequence></xsd:complexType></xsd:element></xsd:all></xsd:complexType></xsd:element><xsd:complexType name="RFC_DB_FLD"><xsd:sequence><xsd:element name="FIELDNAME" minOccurs="0"><xsd:simpleType><xsd:restriction base="xsd:string"><xsd:maxLength value="30"></xsd:maxLength></xsd:restriction></xsd:simpleType></xsd:element><xsd:element name="OFFSET" minOccurs="0"><xsd:simpleType><xsd:restriction base="xsd:string"><xsd:maxLength value="6"></xsd:maxLength><xsd:pattern value="\d*"></xsd:pattern></xsd:restriction></xsd:simpleType></xsd:element><xsd:element name="LENGTH" minOccurs="0"><xsd:simpleType><xsd:restriction base="xsd:string"><xsd:maxLength value="6"></xsd:maxLength><xsd:pattern value="\d*"></xsd:pattern></xsd:restriction></xsd:simpleType></xsd:element><xsd:element name="TYPE" minOccurs="0"><xsd:simpleType><xsd:restriction base="xsd:string"><xsd:maxLength value="1"></xsd:maxLength></xsd:restriction></xsd:simpleType></xsd:element><xsd:element name="FIELDTEXT" minOccurs="0"><xsd:simpleType><xsd:restriction base="xsd:string"><xsd:maxLength value="60"></xsd:maxLength></xsd:restriction></xsd:simpleType></xsd:element></xsd:sequence></xsd:complexType><xsd:complexType name="RFC_DB_OPT"><xsd:sequence><xsd:element name="TEXT" minOccurs="0"><xsd:simpleType><xsd:restriction base="xsd:string"><xsd:maxLength value="72"></xsd:maxLength></xsd:restriction></xsd:simpleType></xsd:element></xsd:sequence></xsd:complexType><xsd:complexType name="SDTI_RESULT"><xsd:sequence><xsd:element name="LINE" minOccurs="0" type="xsd:string"></xsd:element></xsd:sequence></xsd:complexType><xsd:complexType name="TAB512"><xsd:sequence><xsd:element name="WA" minOccurs="0"><xsd:simpleType><xsd:restriction base="xsd:string"><xsd:maxLength value="512"></xsd:maxLength></xsd:restriction></xsd:simpleType></xsd:element></xsd:sequence></xsd:complexType></xsd:schema></types><message name="RFC_READ_TABLEInput"><part name="parameters" element="s0:RFC_READ_TABLE"></part></message><message name="RFC_READ_TABLEOutput"><part name="parameters" element="s0:RFC_READ_TABLE.Response"></part></message><portType name="RFC_READ_TABLEPortType"><operation name="RFC_READ_TABLE"><input message="s0:RFC_READ_TABLEInput"></input><output message="s0:RFC_READ_TABLEOutput"></output></operation></portType><binding name="RFC_READ_TABLEBinding" type="s0:RFC_READ_TABLEPortType"><soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"></soap:binding><operation name="RFC_READ_TABLE"><soap:operation soapAction="http://www.sap.com/RFC_READ_TABLE"></soap:operation><input><soap:body use="literal"></soap:body></input><output><soap:body use="literal"></soap:body></output></operation></binding><service name="RFC_READ_TABLEService"><documentation>SAP Service RFC_READ_TABLE via SOAP</documentation><port name="RFC_READ_TABLEPortType" binding="s0:RFC_READ_TABLEBinding"><soap:address location="https://ldciebj.wdf.sap.corp:44315/sap/bc/soap/rfc"></soap:address></port></service></definitions>